---
type: FamilySizeTable
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# FamilySizeTable

`Autodesk.Revit.DB.FamilySizeTable` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | AsValueString | 2014 | `public string AsValueString ( int row , int column )` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetColumnHeader | 2014 | `public FamilySizeTableColumn GetColumnHeader ( int index )` |
| Method | IsValidColumnIndex | 2014 | `public bool IsValidColumnIndex ( int index )` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | NumberOfColumns | 2014 | `public int NumberOfColumns { get ; }` |
| Property | NumberOfRows | 2014 | `public int NumberOfRows { get ; }` |